###  [3] 파이썬을 이용한

In [2]:
# Section12-3
# 파이썬 데이터베이스 연동(SQLite)
# 테이블 수정 및 삭제

import sqlite3

# DB생성(파일)
base_dir='C:/Users/bluecom014/Desktop/sesac_openai/HTML/sql/'
# conn = sqlite3.connect('eCommerce.db')
conn = sqlite3.connect(base_dir+'eCommerce.db', isolation_level=None)
# Cursor연결
c = conn.cursor()

# 데이터 수정1
c.execute("UPDATE 담당자 SET 담당자이름 = ? WHERE 담당자id = ?", ('niceman', 1))

In [3]:
import pandas as pd

query="SELECT * FROM 담당자"
df=pd.read_sql_query(query,conn)
display(df)

   담당자id    담당자이름           email          phone   website
0      1  niceman    길동@naver.com  010-0000-0000   Kim.com
1      2     Park  Park@naver.com  010-1111-1111  Park.com
2      3      Lee   Lee@naver.com  010-2222-2222   Lee.com
3      4      Cho   Cho@naver.com  010-3333-3333   Cho.com
4      5      Yoo   Yoo@naver.com  010-4444-4444   Yoo.com

In [6]:

# 데이터 수정2
c.execute("UPDATE 담당자 SET 담당자이름 = :name WHERE 담당자id = :id", {"name": 'niceman', 'id': 3})

In [7]:
query="SELECT * FROM 담당자"
df=pd.read_sql_query(query,conn)
display(df)

   담당자id    담당자이름           email          phone   website
0      1  niceman    길동@naver.com  010-0000-0000   Kim.com
1      2     Park  Park@naver.com  010-1111-1111  Park.com
2      3  niceman   Lee@naver.com  010-2222-2222   Lee.com
3      4      Cho   Cho@naver.com  010-3333-3333   Cho.com
4      5      Yoo   Yoo@naver.com  010-4444-4444   Yoo.com

In [9]:

# 데이터 수정3
c.execute("UPDATE 담당자 SET 담당자이름 = '%s' WHERE 담당자id = '%s'" % ('badboy', 5))

In [10]:
query="SELECT * FROM 담당자"
df=pd.read_sql_query(query,conn)
display(df)

   담당자id    담당자이름           email          phone   website
0      1  niceman    길동@naver.com  010-0000-0000   Kim.com
1      2     Park  Park@naver.com  010-1111-1111  Park.com
2      3  niceman   Lee@naver.com  010-2222-2222   Lee.com
3      4      Cho   Cho@naver.com  010-3333-3333   Cho.com
4      5   badboy   Yoo@naver.com  010-4444-4444   Yoo.com

In [11]:

# 중간 데이터 확인1
for user in c.execute('SELECT * FROM 담당자'):
    print(user)

(1, 'niceman', '길동@naver.com', '010-0000-0000', 'Kim.com')
(2, 'Park', 'Park@naver.com', '010-1111-1111', 'Park.com')
(3, 'niceman', 'Lee@naver.com', '010-2222-2222', 'Lee.com')
(4, 'Cho', 'Cho@naver.com', '010-3333-3333', 'Cho.com')
(5, 'badboy', 'Yoo@naver.com', '010-4444-4444', 'Yoo.com')

In [12]:

# Row Delete1
c.execute("DELETE FROM 담당자 WHERE 담당자id = ?", (7,))

In [14]:

# Row Delete2
c.execute("DELETE FROM 담당자 WHERE 담당자id = :id", {'id': 8})

In [ ]:

# Row Delete3
c.execute("DELETE FROM users WHERE id = '%s'" % 9)

In [15]:

# 중간 데이터 확인2
for user in c.execute('SELECT * FROM 담당자'):
    print(user)

(1, 'niceman', '길동@naver.com', '010-0000-0000', 'Kim.com')
(2, 'Park', 'Park@naver.com', '010-1111-1111', 'Park.com')
(3, 'niceman', 'Lee@naver.com', '010-2222-2222', 'Lee.com')
(4, 'Cho', 'Cho@naver.com', '010-3333-3333', 'Cho.com')
(5, 'badboy', 'Yoo@naver.com', '010-4444-4444', 'Yoo.com')

In [16]:

# 테이블 전체 데이터 삭제
print("users db deleted : ", conn.execute("delete from 담당자").rowcount, "rows")

# 관계형 데이터 베이스

# 커밋
conn.commit()

# 접속 해제
conn.close()

users db deleted :  5 rows